app/views/tweets/new.html.erb

      <!-- <% tweets = Tweet.find(:all, :order => "score desc") %> -->
      <% tweets = Tweet.paginate(:page => params[:page], :per_page=>10).order('score desc') %>
---
SELECT "tweets".* FROM "tweets" ORDER BY score DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "tweets"