app/controllers/final_tweets_controller.rb

  def index
    @final_tweets = FinalTweet.paginate(page: params[:page], :per_page => 25, :order=>"created_at DESC")
---
SELECT "final_tweets".* FROM "final_tweets" LIMIT 25 OFFSET 0