app/controllers/tweets_controller.rb

SELECT "ip_addresses".* FROM "ip_addresses" WHERE "ip_addresses"."ip" = '127.0.0.1' LIMIT 1
INSERT INTO "tweets" ("created_at", "score", "text") VALUES (?, ?, ?)  [["created_at", Tue, 23 Apr 2013 23:03:52 UTC +00:00], ["score", nil], ["text", "Test 1"]]
UPDATE "ip_addresses" SET "tweeted" = 't' WHERE "ip_addresses"."id" = 2
---
  def create
    @tweet = Tweet.new(params[:tweet])
    @tweet.score = 0

    # Get current IP address
    current_ip = request.remote_ip

    # Does IP exist in database?
    @ip_address = IPAddress.find_by_ip(current_ip)

    # If IP exists and already tweeted, do nothing
    if @ip_address && @ip_address.tweeted
      flash[:error] = "You already submitted a tweet. Please wait until the next session to submit again."
      redirect_to root_url

    # Else if IP exists but has not tweeted, submit tweet
    elsif @ip_address && !@ip_address.tweeted

      # Recaptcha implementation
      if @tweet.save
        @ip_address.tweeted = true
        @ip_address.save

INSERT INTO "ip_addresses" ("created_at", "downvoted", "ip", "tweeted", "upvoted") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 24 Apr 2013 18:57:36 UTC +00:00], ["downvoted", false], ["ip", "127.0.0.1"], ["tweeted", true], ["upvoted", false]]
---
        @ip_address = IPAddress.new
        @ip_address.ip = current_ip
        @ip_address.tweeted = true
        @ip_address.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = 53 LIMIT 1
SELECT "ip_addresses".* FROM "ip_addresses" WHERE "ip_addresses"."ip" = '127.0.0.1' LIMIT 1
UPDATE "ip_addresses" SET "upvoted" = 't' WHERE "ip_addresses"."id" = 2
UPDATE "tweets" SET "score" = 1 WHERE "tweets"."id" = 53
---
  def upvote
    @tweet = Tweet.find_by_id(params[:id])

    # Get current IP address
    current_ip = request.remote_ip

    # Does IP exist in database?
    @ip_address = IPAddress.find_by_ip(current_ip)

    # If IP exists and already upvoted, do nothing
    if @ip_address && @ip_address.upvoted && @tweet
      flash[:error] = "You already upvoted. Please wait until the next session to upvote again."
      redirect_to root_url

    # Else if IP exists but has not upvoted, upvote
    elsif @ip_address && !@ip_address.upvoted

      @ip_address.upvoted = true
      @ip_address.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = 52 LIMIT 1
SELECT "ip_addresses".* FROM "ip_addresses" WHERE "ip_addresses"."ip" = '127.0.0.1' LIMIT 1
UPDATE "ip_addresses" SET "downvoted" = 't' WHERE "ip_addresses"."id" = 2
UPDATE "tweets" SET "score" = -1 WHERE "tweets"."id" = 52
---
  def downvote
    @tweet = Tweet.find_by_id(params[:id])

    # Get current IP address
    current_ip = request.remote_ip

    # Does IP exist in database?
    @ip_address = IPAddress.find_by_ip(current_ip)

    # If IP exists and already downvoted, do nothing
    if @ip_address && @ip_address.downvoted
      flash[:error] = "You already downvoted. Please wait until the next session to downvote again."
      redirect_to root_url

    # Else if IP exists but has not upvoted, upvote
    elsif @ip_address && !@ip_address.downvoted

      @ip_address.downvoted = true
      @ip_address.save

      @tweet.score = @tweet.score - 1
      @tweet.save

SELECT "tweets".* FROM "tweets"
SELECT COUNT(*) FROM "tweets"
---
  def index
    @tweets = Tweet.paginate(page: params[:page])